clear;
%параметры ма€тника
M = 1; %[kg]
L = 0.842; %[m]
F = 1; % коэффициент трени€
g = 9.8; %[m/sec^2]

%A, B, C , D, tauPhi, tauPsi, Q, QI, R, ft, yref,X0
% матрицы
A = [0 1 0 0 ; 0 -F/M 0 0 ;0 0 0 1; -g/L 0 g/L 0];
B = [0 ; 1/M ; 0 ; 0];
C = [1 0 0 0 ; -1/L 0 1/L 0];
D = [0 ; 0];
wind=0.05;

%весовые матрицы
R=1;
Q = eye(4,4);

%задание матриц коррел€ции
tauPhi = 1;
tauPsi = eye(2,2);
G=eye(4,4);

QI=zeros(8,8);
QI(1,1)=1;
QI(2,2)=1;
QI(3,3)=1;
QI(4,4)=1;

XZ0=zeros(1,8);
XZ0(1, 5:8) = 0.1;
ft =[0; 0 ; 0; wind];
yref = [ 0; 1];
%ft =0*0.005*[1; 1; 1; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0];
%ft=zeros(14,1)
Tend=30;
step= 0.01;
